### Pandas-Dataframe and series
Pandas is powerful data manupulation library in python. widely used for data analysis and data cleaning.It provides two primary data structures. Series and Dataframe. A Series is a one-dimensional array-like object, while dataframe is 2D size, mutable, and potentially heterogeneous tabular data structure with labelled axes(rows and col)

In [1]:
import pandas as pd

In [2]:
data= [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
#create series from dictionary
data1 = {'a':1,'b':2,'c':3,'d':4,'e':5}
series1 = pd.Series(data1)
print(series1)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
#giving index individually
data = [1,2,3,4]
index1 = ['c','d','e','f']
pd.Series(data,index=index1)

c    1
d    2
e    3
f    4
dtype: int64

In [5]:
## Dataframe
## Create a Dataframe from dictionary of list
data = {
    'Name':['Gaurav','Vedant','Vallabh'],
    'Age':[21,26,27],
    'city':['Pune','Pune','Mumbai']
}
df = pd.DataFrame(data)
df

      Name  Age    city
0   Gaurav   21    Pune
1   Vedant   26    Pune
2  Vallabh   27  Mumbai

In [12]:
df['Name']

0     Gaurav
1     Vedant
2    Vallabh
Name: Name, dtype: object

In [14]:
#accessing via index number
df.loc[0]

Name    Gaurav
Age         21
city      Pune
Name: 0, dtype: object

In [18]:
df

      Name  Age    city
0   Gaurav   21    Pune
1   Vedant   26    Pune
2  Vallabh   27  Mumbai

In [24]:
#accessing specialized element
df.at[1,'Name']

'Vedant'

In [26]:
# accessing via only index
df.iat[2,2]

'Mumbai'

### Data Manupulation with dataframe

In [31]:
df

      Name  Age    city
0   Gaurav   21    Pune
1   Vedant   26    Pune
2  Vallabh   27  Mumbai

In [37]:
#adding a column
df['Salary'] = [60000,70000,50000]
df

      Name  Age    city  Salary
0   Gaurav   21    Pune   60000
1   Vedant   26    Pune   70000
2  Vallabh   27  Mumbai   50000

In [41]:
## Remove the column
df.drop('city',axis=1)  #you need to give axis value
## axis = 0 --> row search
## axis = 1 --> column search
## but when I call it, again this column appear

      Name  Age  Salary
0   Gaurav   21   60000
1   Vedant   26   70000
2  Vallabh   27   50000

In [45]:
df #but when I call it, again this column appear
#drop operation is temperory, to save state of dataframe we use inplace=true

      Name  Age    city  Salary
0   Gaurav   21    Pune   60000
1   Vedant   26    Pune   70000
2  Vallabh   27  Mumbai   50000

In [47]:
df.drop('city',axis=1,inplace=True) #now it will permanantly delete the col

In [49]:
df

      Name  Age  Salary
0   Gaurav   21   60000
1   Vedant   26   70000
2  Vallabh   27   50000

In [51]:
#add age to column
df['Age'] = df['Age']+1

In [53]:
df

      Name  Age  Salary
0   Gaurav   22   60000
1   Vedant   27   70000
2  Vallabh   28   50000